We're looking for primes `p` for which `(p-1)` has a factor of `2^k` for `k` of
at least `20`.

Here's a sage script for finding them:

```
def search(k, n, probes):
    q_max = 2^(n-k)
    for i in range(probes):
        q = q_max - i
        p = 2^k * q + 1
        if is_prime(p):
            score = float(2^n - p) / 2^n
            print(round(score, 6), p, factor(p-1))
```

Here are some reasonable choices:

```
sage: search(64, 128, 100)
0.0 340282366920938462946865773367900766209 2^66 * 3 * 3491 * 440340496364689
0.0 340282366920938462024528569682423185409 2^65 * 31 * 10037 * 29643133428427
sage: search(64, 126, 200)
0.0 85070591730234613320192969686023929857 2^65 * 138143 * 16691710830181
0.0 85070591730234613043491808580380655617 2^64 * 4611686018427387751
0.0 85070591730234612969704832285542449153 2^64 * 3^2 * 239 * 36353 * 58976509349
sage: search(32, 80, 200)
0.0 1208925819614152433336321 2^32 * 5 * 56294995342109
0.0 1208925819614122368565249 2^33 * 3^2 * 13 * 2411 * 2591 * 192557
0.0 1208925819614032174252033 2^32 * 3 * 29 * 787 * 4110984193
0.0 1208925819613993519546369 2^34 * 3 * 7 * 13697 * 244644271
0.0 1208925819613903325233153 2^32 * 3 * 7 * 53 * 71 * 33757 * 105517
0.0 1208925819613791656083457 2^32 * 97 * 491 * 5909987543
sage: search(32, 64, 20)
0.0 18446744069414584321 2^32 * 3 * 5 * 17 * 257 * 65537
0.0 18446744056529682433 2^34 * 3^2 * 7 * 11 * 31 * 151 * 331
```
